<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Plearn-developers] erreurs, warnings, logs, etc.
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/plearn-developers/2008-November/index.html" >
   <LINK REL="made" HREF="mailto:plearn-developers%40lists.berlios.de?Subject=Re%3A%20%5BPlearn-developers%5D%20erreurs%2C%20warnings%2C%20logs%2C%20etc.&In-Reply-To=%3C2d1d7fe70811261339q30c81cado429d8ab865b8e4f9%40mail.gmail.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000199.html">
   <LINK REL="Next"  HREF="000192.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Plearn-developers] erreurs, warnings, logs, etc.</H1>
    <B>Fr&#233;d&#233;ric Bastien</B> 
    <A HREF="mailto:plearn-developers%40lists.berlios.de?Subject=Re%3A%20%5BPlearn-developers%5D%20erreurs%2C%20warnings%2C%20logs%2C%20etc.&In-Reply-To=%3C2d1d7fe70811261339q30c81cado429d8ab865b8e4f9%40mail.gmail.com%3E"
       TITLE="[Plearn-developers] erreurs, warnings, logs, etc.">nouiz at nouiz.org
       </A><BR>
    <I>Wed Nov 26 22:39:13 CET 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000199.html">[Plearn-developers] erreurs, warnings, logs, etc.
</A></li>
        <LI>Next message: <A HREF="000192.html">[Plearn-developers] erreurs, warnings, logs, etc.
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#187">[ date ]</a>
              <a href="thread.html#187">[ thread ]</a>
              <a href="subject.html#187">[ subject ]</a>
              <a href="author.html#187">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Salut,

Une chose que je croit important c'est qu'il soit facile et que cela
soit clair dans la documentation comment avoir tout les messages de
debug. Ceci est la raison pourquoi personnelement je n'utilise pas
pl_log, la doc est perdu dans un email et c'est moi qui par hazard a
rejout&#233; de l'info dans &quot;plearn help&quot; sur sa syntaxe si je me rappele
bien. Par example &quot;pymake -dbg ...&quot; devrait continuer a donner tous
les messages de debug par default. Si on ne garde pas cela, on risque
de perdre des messages quand on debogue.

En ce moment, on a tous les messages de debug en compilant avec -dbg
car tous les PLWARNINGS sont toujours imprim&#233;. Il faut juste ne pas
perdre cette simplicit&#233; pour tout logger. On pourrait perdre des
messages de debug si on se mets a envoyer plusieurs PLWARNING en mode
DEBUG, car ce niveau de log n'est pas imprim&#233; par default. Pour les
imprimers il faudrait faire: &quot;plearn --verbosity VLEVEL_DBG&quot;, ce qui
complique un peu les choses et risque que nous oublions de le faire
une fois de temps en temps. Ceci est comme le build bot qui nous
rappelle a l'ordre de temps en temps.

Dans le cas particulier des messages d'erreur que tu as eu, je crois
que c'est la classe BootstrapVMatrix(qui h&#233;rite de SelectRowsVMatrix)
qui devrait mettre warn_if_all_rows_selected a faut quand on l'utilise
juste pour un shuffle.(Je crois que c'est bien cette class qui est
utiliser dans ton cas, mais je peux me tromper). Autre choses
possible, Dans SelectRowsVMatrix, on peut  generer le message d'erreur
seulement si on selectionne toutes les lignes et qu'elles sont dans
l'ordre de 0 a n-1(utilisation inutile de la classe).

la classe SortRowsVMatrix herite aussi de SelectRowsVMatrix, si on
modifie BootstrapVMatrix pour ne pas reneger le message d'erreur il
faudrait aussi modifier SortRowsVMatrix. Donc modifier
SelectRowsVMatrix semble la meilleur solution.

Qu'est-ce que vous en pens&#233;?

Fred


2008/11/26 Xavier Saint-Mleux &lt;<A HREF="https://lists.berlios.de/mailman/listinfo/plearn-developers">saintmlx at apstat.com</A>&gt;:
&gt;<i> Salut &#224; tous,
</I>&gt;<i>
</I>&gt;<i> Je crois qu'il serait temps de [re]faire la lumi&#232;re sur les m&#233;canismes
</I>&gt;<i> pr&#233;sents dans PLearn pour l'envoi de diff&#233;rents types de messages.  *En
</I>&gt;<i> particulier, j'aimerais rendre &quot;deprecated&quot; les PLWARNINGS, alors
</I>&gt;<i> s.v.p. lisez attentivement!*
</I>&gt;<i>
</I>&gt;<i> Il y a deux cat&#233;gories de cas pr&#233;visibles pour lesquels on veut faire
</I>&gt;<i> planter PLearn:
</I>&gt;<i>
</I>&gt;<i> - Ajout de code qui ne respecte pas la s&#233;mantique: Les PLASSERTs devraient
</I>&gt;<i>  servir &#224; s'assurer que le code est &quot;robuste sous &#233;volution&quot;, c'est-&#224;-dire
</I>&gt;<i>  &#224; s'assurer que le nouveau code respecte la s&#233;mantique pr&#233;vue par le code
</I>&gt;<i>  d&#233;j&#224; existant.  Les PLASSERTs s'adressent aux d&#233;veloppeurs et indiquent
</I>&gt;<i>  ce que le nouveau code a bris&#233;.
</I>&gt;<i>
</I>&gt;<i> - Utilisation erronn&#233;e de code existant: Les PLERRORs devraient servir aux
</I>&gt;<i>  cas d'inputs invalides fournis &#224; PLearn et &#224; indiquer &#224; l'usager ce qui
</I>&gt;<i>  ne va pas et (si possible) comment le corriger.
</I>&gt;<i>
</I>&gt;<i> Il y a ensuite une multitude d'autres cas pour lesquels on voudrait donner
</I>&gt;<i> de l'information &#224; l'usager et/ou au d&#233;veloppeur, et pour chacun de ces cas
</I>&gt;<i> il peut exister des conditions dans lesquelles on veut avoir l'information
</I>&gt;<i> et d'autres o&#249; on ne la veut pas.  Il y a aussi une multitude de mani&#232;res
</I>&gt;<i> de fournir ce genre d'information &#224; l'usager, et justement il commence
</I>&gt;<i> peut-&#234;tre &#224; y en avoir un peu trop...
</I>&gt;<i>
</I>&gt;<i> - Il y a toujours eu les streams de base, pout, perr, etc., mais ces
</I>&gt;<i>  streams ne devraient [presque] jamais &#234;tre utilis&#233;es directement (trop
</I>&gt;<i>  bas niveau.)
</I>&gt;<i>
</I>&gt;<i> - Il y a depuis longtemps les PLWARNINGS (et depuis peu les PLWARN_ERR) qui
</I>&gt;<i>  servent &#224; &quot;avertir&quot; l'usager au besoin, mais:
</I>&gt;<i>
</I>&gt;<i>  - Tous les PLWARNINGs font partie de la m&#234;me cat&#233;gorie: PLWARNING.  Ce
</I>&gt;<i>   n'est pas tr&#232;s pr&#233;cis.
</I>&gt;<i>
</I>&gt;<i>  - On n'a aucun contr&#244;le sur l'affichage de diff&#233;rents messages (ou de
</I>&gt;<i>   diff&#233;rents types de messages): tout est toujours affich&#233; dans tous les
</I>&gt;<i>   cas (sauf si on s'arrange pour qu'absolument rien ne soit affich&#233;.)
</I>&gt;<i>
</I>&gt;<i>  - Il n'existe pas une r&#232;gle g&#233;n&#233;rale universelle pour d&#233;cider dans quel
</I>&gt;<i>   cas un avertissement est justifi&#233; et dans quel cas il est superflu.
</I>&gt;<i>
</I>&gt;<i>  - &#199;a utilise une syntaxe qui rappelle plus le langage C que le C++; &#231;a ne
</I>&gt;<i>   s'utilise absolument pas de la m&#234;me mani&#232;re que les streams (tout comme
</I>&gt;<i>   PLERROR, je sais...)
</I>&gt;<i>
</I>&gt;<i> Pour les messages qui ne requi&#232;rent pas n&#233;cessairement d'intervention
</I>&gt;<i> de la part de l'usager, on a besoin de pouvoir cat&#233;goriser ces messages et
</I>&gt;<i> de pouvoir activer ou non l'affichage ce certains de ces messages.
</I>&gt;<i>
</I>&gt;<i> e.g. en ce moment, lorsqu'on fait du bagging, on a le message suivant qui
</I>&gt;<i> s'affiche &#224; r&#233;p&#233;tition (une fois par bag): &quot;In SelectRowsVMatrix::build_()
</I>&gt;<i> - All rows have been selected!&quot;.  Comment se fait-il que chacun des bags
</I>&gt;<i> soit en fait le dataset original? c'est inqui&#233;tant!  En r&#233;alit&#233;, ce n'est
</I>&gt;<i> pas le cas, tout va bien, il n'y a aucun probl&#232;me et les bags sont tous
</I>&gt;<i> diff&#233;rents... mais j'ai perdu un temps fou &#224; m'en assurer.  C'est donc un
</I>&gt;<i> tr&#232;s bon exemple de PLWARNING superflu (pourquoi un message dans un des cas
</I>&gt;<i> d'utilisation les plus fr&#233;quents? c'est la m&#234;me chose pour Shuffle, mais
</I>&gt;<i> dans ce cas &#231;a a &#233;t&#233; patch&#233; sp&#233;cialement pour &#231;a -- oui, oui, la
</I>&gt;<i> super-classe doit &#234;tre consciente de la sous-classe!!!) en plus d'&#234;tre un
</I>&gt;<i> message trompeur (autant de rang&#233;es ne veut pas n&#233;cessairement dire toutes
</I>&gt;<i> les rang&#233;es.)  Par contre ce genre message peut &#234;tre tr&#232;s int&#233;ressant quand
</I>&gt;<i> on est en train de d&#233;boguer, alors on ne veut pas n&#233;cessairement l'&#233;liminer
</I>&gt;<i> dans tous les cas (seulement dans la tr&#232;s grande majorit&#233; des cas; il ne
</I>&gt;<i> faut pas crier &quot;au loup&quot; et noyer l'information la plus pertinente en
</I>&gt;<i> avertissant l'usager de tout ce qui se passe, sinon les gens vont ignorer
</I>&gt;<i> tous les messages.)
</I>&gt;<i>
</I>&gt;<i> HEUREUSEMENT, on a (depuis 2004) le module pl_log qui fait tout ce dont on
</I>&gt;<i> a besoin!  Ce module d&#233;finit un ensemble de streams pour du &quot;logging&quot;.  Ces
</I>&gt;<i> streams sont class&#233;es par importance et par module, et on peut donc
</I>&gt;<i> cat&#233;goriser les messages en: 'mandatory', 'important', 'normal', 'debug' ou
</I>&gt;<i> 'extreme' (le cas de SelectRows est un bon exemple de 'debug' selon moi.)
</I>&gt;<i> On peut ensuite d&#233;cider du niveau de verbosit&#233; que l'on d&#233;sire quand on
</I>&gt;<i> roule PLearn, e.g. pas de messages 'debug' quand on n'est pas en train de
</I>&gt;<i> d&#233;boguer.  La &quot;bonne&quot; mani&#232;re d'utiliser pl_log est aussi d'avoir des logs
</I>&gt;<i> nomm&#233;s pour chaque module (.cc) plut&#244;t que d'utiliser les logs globaux.  On
</I>&gt;<i> peut ensuite d&#233;cider de faire afficher les messages seulement pour les
</I>&gt;<i> modules qui nous int&#233;ressent, en plus de choisir le niveau de verbosit&#233;.
</I>&gt;<i> En plus de ces avantages, les logs permettent de beaucoup plus facilement
</I>&gt;<i> rediriger les diff&#233;rents messages de diff&#233;rentes mani&#232;res.  Finalement, les
</I>&gt;<i> logs sont des streams C++ comme les autres et s'utilisent donc de mani&#232;re
</I>&gt;<i> naturelle pour un programmeur C++.
</I>&gt;<i>
</I>&gt;<i> Si personne n'&#233;met d'objection d'ici peu, je vais commencer par convertir
</I>&gt;<i> certains PLWARNINGS, question de donner l'exemple, et &#233;ventuellement
</I>&gt;<i> &#233;liminer de plerror tout ce qui a trait &#224; des warnings.
</I>&gt;<i>
</I>&gt;<i> En attendant, j'encourage tout le monde &#224; se familiariser avec:
</I>&gt;<i> - $PLEARNDIR/plearn/io/pl_log.{h,cc}
</I>&gt;<i>
</I>&gt;<i> Tout feedback est bienvenu,
</I>&gt;<i>
</I>&gt;<i> Xavier
</I>&gt;<i>
</I>&gt;<i>
</I>
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000199.html">[Plearn-developers] erreurs, warnings, logs, etc.
</A></li>
	<LI>Next message: <A HREF="000192.html">[Plearn-developers] erreurs, warnings, logs, etc.
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#187">[ date ]</a>
              <a href="thread.html#187">[ thread ]</a>
              <a href="subject.html#187">[ subject ]</a>
              <a href="author.html#187">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/plearn-developers">More information about the Plearn-developers
mailing list</a><br>
</body></html>
